Documents/ПолучениеФактическихДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ПолучениеФактическихДанных</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОборотыПоПланированию</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КомментарийДокумента</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ФактическиеДанные</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Показатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПоказателиПланирования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦФО</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦФО</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Специализация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КатегорииВыработки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ОборотыПоПланированию.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ОборотыПоПланированию</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Показатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПоказателиПланирования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦФО</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦФО</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Специализация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииВыработки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сценарий</Name>
					<Comment>ИСТИНА - Факт, ЛОЖЬ - План</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/ПолучениеФактическихДанных/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Перем Филиал;

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	РаботаСФормамиСервер.ФормаДокументаПриОткрытииСервер(ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Филиал = УправлениеНастройками.ПолучитьФилиалПоУмолчаниюПользователя();
	ПечатьДокументовКлиент.УстановитьЗаголовокПечатнойФормы(ЭтаФорма);
	НастроитьРеквизитыТабличныхЧастей();
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	РаботаСФормамиСервер.ВывестиЗаголовокФормыДокумента(ТекущийОбъект, Ложь, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)

	НастроитьРеквизитыТабличныхЧастей();
	
КонецПроцедуры

&НаКлиенте
Процедура ФактическиеДанныеПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если Не Копирование Тогда	
		Элемент.ТекущиеДанные.ЦФО = Филиал;	
	КонецЕсли; 
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьФактическиеДанные(Команда)

	Если Не ЗначениеЗаполнено(Объект.Период) Тогда
		Предупреждение(НСтр("ru = 'Не указан месяц!'"));
		Возврат;
	КонецЕсли;
	
	Если Объект.ФактическиеДанные.Количество() > 0 Тогда
		
		ТекстВопроса = НСтр("ru = 'Перед заполнением предопределенные элементы будут удалены из табличной части. Заполнить?'");
		Ответ = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да, Строка(Объект.Ссылка));
		Если Ответ <> КодВозвратаДиалога.Да Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ЗаполнитьФактическиеДанныеСервер();
	НастроитьРеквизитыТабличнойЧастиФактическиеДанные();
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнитьНепредопределенныеПоказатели(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Период) Тогда
		Предупреждение(НСтр("ru = 'Не указан месяц!'"));
		Возврат;
	КонецЕсли;
	
	ЗаполнитьНепредопределенныеПоказателиСервер();
	НастроитьРеквизитыТабличнойЧастиФактическиеДанные();
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура Сортировать(Команда)
	
	Объект.ФактическиеДанные.Сортировать("Показатель, ЦФО, Специализация, Сотрудник, Номенклатура");
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВывестиДвиженияДокумента(Команда)
	
	РаботаСДиалогамиКлиент.ВывестиДвиженияДокумента(Объект.Ссылка, Команда);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	Объект.Период = НачалоМесяца(Объект.Период);
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Попытка
		Объект.Период = НачалоМесяца(ДобавитьМесяц(Объект.Период, Направление));
	Исключение 
	КонецПопытки;
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ФактическиеДанныеПоказательПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ФактическиеДанные.ТекущиеДанные; 
	Если ТекущиеДанные <> Неопределено Тогда  
		ДанныеПоказателя = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТекущиеДанные.Показатель, 
			"Учет_Специализация, Учет_Сотрудник, Учет_Номенклатура");
		СтрокаФактическиеДанные = Объект.ФактическиеДанные[ТекущиеДанные.НомерСтроки-1];
		ЗаполнитьЗначенияСвойств(СтрокаФактическиеДанные, ДанныеПоказателя); 
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьФактическиеДанныеСервер()

	Документы.ПолучениеФактическихДанных.ЗаполнитьФактическиеДанные(Объект);

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНепредопределенныеПоказателиСервер()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ОборотыПоПланированию.Период КАК Период,
	               |	ОборотыПоПланированию.Показатель КАК Показатель,
	               |	ОборотыПоПланированию.ЦФО КАК ЦФО,
	               |	ОборотыПоПланированию.Специализация КАК Специализация,
	               |	ОборотыПоПланированию.Сотрудник КАК Сотрудник,
	               |	ОборотыПоПланированию.Номенклатура КАК Номенклатура
	               |ИЗ
	               |	РегистрНакопления.ОборотыПоПланированию КАК ОборотыПоПланированию
	               |ГДЕ
	               |	ОборотыПоПланированию.Период = &Период
	               |	И ОборотыПоПланированию.Сценарий";
	
	Запрос.УстановитьПараметр("Период", Объект.Период);
	Результат = Запрос.Выполнить().Выгрузить();
	
	Если Результат.Количество() <> 0 Тогда
		Для Каждого СтрокаПоказатель Из Результат Цикл
			Если Не СтрокаПоказатель.Показатель.Предопределенный Тогда
				
				Структура = Новый Структура;
				Структура.Вставить("Показатель",СтрокаПоказатель.Показатель);
				Структура.Вставить("ЦФО",СтрокаПоказатель.ЦФО);
				Структура.Вставить("Специализация",СтрокаПоказатель.Специализация);
				Структура.Вставить("Сотрудник",СтрокаПоказатель.Сотрудник);
				Структура.Вставить("Номенклатура",СтрокаПоказатель.Номенклатура);
				
				Если Объект.ФактическиеДанные.НайтиСтроки(Структура).количество() = 0 Тогда
					СтрокаФактическиеДанные = Объект.ФактическиеДанные.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаФактическиеДанные, СтрокаПоказатель);
				КонецЕсли;	
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьРеквизитыТабличныхЧастей()

	НастроитьРеквизитыТабличнойЧастиФактическиеДанные();
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьРеквизитыТабличнойЧастиФактическиеДанные()

	Для Каждого СтрокаФактическиеДанные Из Объект.ФактическиеДанные Цикл   
		ДанныеПоказателя = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтрокаФактическиеДанные.Показатель, 
			"Учет_Специализация, Учет_Сотрудник, Учет_Номенклатура");
		ЗаполнитьЗначенияСвойств(СтрокаФактическиеДанные, ДанныеПоказателя);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// Добавлено Макеев (
	омг_ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	// )
КонецПроцедуры

#КонецОбласти
